{
    "What was the best selling item last year on Black Friday?": "It is not possible to construct a no sequel query with the schema provided to determine the best selling item last year on Black Friday.",
    "What stone will be best to sell this year on Black Friday?": "It is not possible to construct a no sequel query with the schema provided to determine which stone will be best to sell this year on Black Friday.",
    "What are the top 5 best selling products in the Silver Necklace product category?": "```json\ndb.products.aggregate([\n    {\n        $match: {\n            \"category.categoryName\": \"Silver Necklace\"\n        }\n    },\n    {\n        $lookup: {\n            from: \"orders\",\n            localField: \"productId\",\n            foreignField: \"orderLines.productId\",\n            as: \"orderDetails\"\n        }\n    },\n    {\n        $unwind: \"$orderDetails\"\n    },\n    {\n        $group: {\n            _id: \"$productId\",\n            productName: { $first: \"$productName\" },\n            totalSales: { $sum: \"$orderDetails.orderLines.quantity\" }\n        }\n    },\n    {\n        $sort: { totalSales: -1 }\n    },\n    {\n        $limit: 5\n    }\n])\n```",
    "What is the best-selling item today?": "```json\ndb.orders.aggregate([\n    {\n        $match: {\n            orderDate: { $gte: ISODate(\"2024-11-28T00:00:00Z\"), $lt: ISODate(\"2024-11-29T00:00:00Z\") }\n        }\n    },\n    {\n        $unwind: \"$orderLines\"\n    },\n    {\n        $group: {\n            _id: \"$orderLines.productId\",\n            productName: { $first: \"$orderLines.productName\" },\n            totalSales: { $sum: \"$orderLines.quantity\" }\n        }\n    },\n    {\n        $sort: { totalSales: -1 }\n    },\n    {\n        $limit: 1\n    }\n])\n```",
    "How much of sales came from 1 year dormant customers?": "It is not possible to construct a no sequel query with the schema provided to determine how much of sales came from 1 year dormant customers.",
    "Yesterday, how much of sales came from 1 year dormant customers?": "It is not possible to construct a no sequel query with the schema provided to determine how much of sales came from 1 year dormant customers yesterday.",
    "Did those customers use any code?": "It is not possible to construct a no sequel query with the schema provided to determine if those customers used any code.",
    "Yesterday, did the dormant customers use any promo code?": "It is not possible to construct a no sequel query with the schema provided to determine if dormant customers used any promo code yesterday.",
    "What price point is best suitable for Black Friday sales?": "It is not possible to construct a no sequel query with the schema provided to determine what price point is best suitable for Black Friday sales.",
    "What price range is most suitable for Black Friday sales?": "It is not possible to construct a no sequel query with the schema provided to determine what price range is most suitable for Black Friday sales.",
    "What price range of items has better conversion rate in the Black Friday season period?": "It is not possible to construct a no sequel query with the schema provided to determine what price range of items has a better conversion rate in the Black Friday season period.",
    "Which price range has more conversion on website and mobile in the Black Friday season?": "It is not possible to construct a no sequel query with the schema provided to determine which price range has more conversion on the website and mobile in the Black Friday season.",
    "What is the number of orders cancelled within 10 secs in the last month and what is the total amount of those cancelled orders?": "```json\ndb.orders.aggregate([\n    {\n        $match: {\n            status: \"Cancelled\",\n            orderDate: { $gte: ISODate(\"2024-10-28T00:00:00Z\"), $lt: ISODate(\"2024-11-28T00:00:00Z\") }\n        }\n    },\n    {\n        $group: {\n            _id: null,\n            totalCancelledOrders: { $sum: 1 },\n            totalCancelledAmount: { $sum: \"$totalAmounts.grossAmount\" }\n        }\n    },\n    {\n        $project: {\n            _id: 0,\n            totalCancelledOrders: 1,\n            totalCancelledAmount: 1\n        }\n    }\n])\n```",
    "From which sales source maximum cancellation is happening?": "```json\ndb.orders.aggregate([\n    {\n        $match: {\n            status: \"Cancelled\"\n        }\n    },\n    {\n        $group: {\n            _id: \"$orderSource\",\n            cancellationCount: { $sum: 1 }\n        }\n    },\n    {\n        $sort: { cancellationCount: -1 }\n    },\n    {\n        $limit: 1\n    }\n])\n```",
    "What is the growth on digital platforms year on year as compared to last year?": "It is not possible to construct a no sequel query with the schema provided to determine the growth on digital platforms year on year as compared to last year.",
    "From which promo code maximum sales conversion is coming?": "It is not possible to construct a no sequel query with the schema provided to determine from which promo code maximum sales conversion is coming.",
    "What is the conversion rate of customers which are coming from sweepstakes?": "It is not possible to construct a no sequel query with the schema provided to determine the conversion rate of customers coming from sweepstakes.",
    "What is the conversion rate of customers which are coming from sweepstakes in the last 6 months?": "It is not possible to construct a no sequel query with the schema provided to determine the conversion rate of customers coming from sweepstakes in the last 6 months.",
    "How much sales contribution in percentage is coming from lab grown diamonds in the last 1 month?": "It is not possible to construct a no sequel query with the schema provided to determine the sales contribution in percentage coming from lab-grown diamonds in the last 1 month.",
    "Which shape in the lab grown is the most selling?": "It is not possible to construct a no sequel query with the schema provided to determine which shape in lab-grown diamonds is the most selling.",
    "What percentage of auction participants are new versus returning customers?": "It is not possible to construct a no sequel query with the schema provided to determine the percentage of auction participants who are new versus returning customers.",
    "What is the Average Selling Price (ASP) for items sold through auctions?": "It is not possible to construct a no sequel query with the schema provided to determine the Average Selling Price (ASP) for items sold through auctions.",
    "Is it a good strategy to post images on TikTok?": "It is not possible to construct a no sequel query with the schema provided to determine whether posting images on TikTok is a good strategy.",
    "Help me create an organic content strategy for TikTok. Please include the type of format for the content as well.": "It is not possible to construct a no sequel query with the schema provided to create an organic content strategy for TikTok.",
    "What are effective TikTok content formats for organic growth?": "It is not possible to construct a no sequel query with the schema provided to determine effective TikTok content formats for organic growth.",
    "How to develop a TikTok content strategy for organic reach?": "It is not possible to construct a no sequel query with the schema provided to develop a TikTok content strategy for organic reach.",
    "When creating a campaign on Meta what should be the ideal audience to target?": "It is not possible to construct a no sequel query with the schema provided to determine the ideal audience to target when creating a campaign on Meta.",
    "Give me 5 products that I can promote on Facebook.": "It is not possible to construct a no sequel query with the schema provided to identify specific products that can be promoted on Facebook.",
    "Suggest 5 products suitable for Meta campaigns.": "It is not possible to construct a no sequel query with the schema provided to suggest specific products suitable for Meta campaigns.",
    "What are the trending keywords on Google for Black Friday?": "It is not possible to construct a no sequel query with the schema provided to determine the trending keywords on Google for Black Friday.",
    "Compare the sales performance of Meta for 2023 and 2024.": "It is not possible to construct a no sequel query with the schema provided to compare the sales performance of Meta for 2023 and 2024.",
    "What is the distribution of sales across different sales channels?": "It is not possible to construct a no sequel query with the schema provided to determine the distribution of sales across different sales channels.",
    "What is the distribution of sales across Google and Meta?": "It is not possible to construct a no sequel query with the schema provided to determine the distribution of sales across Google and Meta.",
    "What is the month wise sales and return percentage on loose lab grown diamond in the last 3 months?": "It is not possible to construct a no sequel query with the schema provided to determine the month-wise sales and return percentage on loose lab-grown diamonds in the last 3 months.",
    "What is best-seller item today?": "It is not possible to construct a no sequel query with the schema provided to determine the best-seller item today.",
    "Tell me which products today outperformed the set target.": "It is not possible to construct a no sequel query with the schema provided to determine which products today outperformed the set target.",
    "Searching for products by category name that outperformed their targets today?": "It is not possible to construct a no sequel query with the schema provided to search for products by category name that outperformed their targets today.",
    "Searching for products by category name that exceeded their targets this week?": "It is not possible to construct a no sequel query with the schema provided to search for products by category name that exceeded their targets this week.",
    "Give top selling products in last 7 days.": "It is not possible to construct a no sequel query with the schema provided to determine the top-selling products in the last 7 days.",
    "Give me top selling loose gemstones from last 7 days on web.": "It is not possible to construct a no sequel query with the schema provided to determine the top-selling loose gemstones from the last 7 days on the web.",
    "Give me top selling products from loose gemstone category on web in last 7 days.": "It is not possible to construct a no sequel query with the schema provided to determine the top-selling products from the loose gemstone category on the web in the last 7 days.",
    "Which are top 3 categories on FPC, in terms of revenue, in last 7 days?": "It is not possible to construct a no sequel query with the schema provided to determine the top 3 categories on FPC in terms of revenue in the last 7 days.",
    "Other than lab grown diamond, give me top 5 selling products in loose gemstones category.": "It is not possible to construct a no sequel query with the schema provided to determine the top 5 selling products in the loose gemstones category, excluding lab-grown diamonds.",
    "Do you have access to last year data?": "It is not possible to construct a no sequel query with the schema provided to determine access to last year's data.",
    "Share how many products got returned by customers in the month of August.": "It is not possible to construct a no sequel query with the schema provided to determine how many products got returned by customers in the month of August.",
    "How much value of products were returned in the month of August, give me dollar figure.": "It is not possible to construct a no sequel query with the schema provided to determine the dollar value of products returned in the month of August.",
    "What are top 5 performing Tanzanite SKUs in loose gems category on web?": "It is not possible to construct a no sequel query with the schema provided to determine the top 5 performing Tanzanite SKUs in the loose gems category on the web.",
    "Are there specific price ranges that lead to higher sales volumes?": "It is not possible to construct a no sequel query with the schema provided to determine specific price ranges that lead to higher sales volumes.",
    "Are there specific price ranges that lead to higher sales volumes for loose gems category?": "It is not possible to construct a no sequel query with the schema provided to determine specific price ranges that lead to higher sales volumes for the loose gems category.",
    "What impact do discounts or promotional offers have on the sales of loose gemstones?": "It is not possible to construct a no sequel query with the schema provided to determine the impact of discounts or promotional offers on the sales of loose gemstones.",
    "What are the top three most popular gemstones sold on this website?": "It is not possible to construct a no sequel query with the schema provided to determine the top three most popular gemstones sold on the website.",
    "What are the primary demographics of customers purchasing loose gemstones?": "It is not possible to construct a no sequel query with the schema provided to determine the primary demographics of customers purchasing loose gemstones.",
    "Do loose gemstones sell better via the website or other channels like live TV auctions?": "It is not possible to construct a no sequel query with the schema provided to determine whether loose gemstones sell better via the website or other channels like live TV auctions.",
    "What is growth for Thanksgiving days, Black Friday & Cyber Monday in last 5 years?": "It is not possible to construct a no sequel query with the schema provided to determine the growth for Thanksgiving days, Black Friday, and Cyber Monday in the last 5 years.",
    "What is growth for Thanksgiving days, Black Friday & Cyber Monday in last 5 years for ShopLC?": "It is not possible to construct a no sequel query with the schema provided to determine the growth for Thanksgiving days, Black Friday, and Cyber Monday in the last 5 years specifically for ShopLC.",
    "What is growth percentage for Thanksgiving day, Black Friday & Cyber Monday for last 2 years?": "It is not possible to construct a no sequel query with the schema provided to determine the growth percentage for Thanksgiving Day, Black Friday, and Cyber Monday for the last 2 years.",
    "Give me sales growth Black Friday 2022 versus 2023.": "It is not possible to construct a no sequel query with the schema provided to determine the sales growth for Black Friday 2022 versus 2023.",
    "Please share last year Black Friday sales.": "It is not possible to construct a no sequel query with the schema provided to determine last year's Black Friday sales.",
    "Please share sales for Black Friday 2023.": "It is not possible to construct a no sequel query with the schema provided to determine sales for Black Friday 2023.",
    "What is web sales and contribution percentage in total ShopLC sales for 2023-24?": "It is not possible to construct a no sequel query with the schema provided to determine web sales and contribution percentage in total ShopLC sales for 2023-24.",
    "What is web and mobile sales and contribution percentage in total ShopLC sales for 2023-24?": "It is not possible to construct a no sequel query with the schema provided to determine web and mobile sales and contribution percentage in total ShopLC sales for 2023-24.",
    "What is PNP per PC for RA for last year?": "It is not possible to construct a no sequel query with the schema provided to determine PNP per PC for RA for last year.",
    "Please share all channel wise sales for last year.": "It is not possible to construct a no sequel query with the schema provided to determine all channel-wise sales for last year.",
    "What is online auction sales for last year?": "It is not possible to construct a no sequel query with the schema provided to determine online auction sales for last year.",
    "What is RA sales for last year?": "It is not possible to construct a no sequel query with the schema provided to determine RA sales for last year.",
    "What is mobile sales for last year?": "It is not possible to construct a no sequel query with the schema provided to determine mobile sales for last year.",
    "What is mobile sales for 2023-24?": "It is not possible to construct a no sequel query with the schema provided to determine mobile sales for 2023-24.",
    "What is mobile sales for April 2023 to March 2024?": "It is not possible to construct a no sequel query with the schema provided to determine mobile sales for April 2023 to March 2024.",
    "What is web and mobile sales for Black Friday 2023?": "It is not possible to construct a no sequel query with the schema provided to determine web and mobile sales for Black Friday 2023.",
    "What is web and mobile total sales for Black Friday 2023?": "It is not possible to construct a no sequel query with the schema provided to determine web and mobile total sales for Black Friday 2023.",
    "What is total sales for April 2023 to March 2024?": "It is not possible to construct a no sequel query with the schema provided to determine total sales for April 2023 to March 2024.",
    "What is $1 auction sales for April 2023 to March 2024?": "It is not possible to construct a no sequel query with the schema provided to determine $1 auction sales for April 2023 to March 2024.",
    "What is total sales for Black Friday 2023?": "It is not possible to construct a no sequel query with the schema provided to determine total sales for Black Friday 2023.",
    "What is sales for Black Friday 2022 and 2023?": "It is not possible to construct a no sequel query with the schema provided to determine sales for Black Friday 2022 and 2023.",
    "What is average sales for Sunday for April 2024 to October 2024?": "It is not possible to construct a no sequel query with the schema provided to determine average sales for Sunday for April 2024 to October 2024.",
    "What is average sales for 22 hour in October 2024?": "It is not possible to construct a no sequel query with the schema provided to determine average sales for 22 hour in October 2024.",
    "What is average sales for 10pm from April 2024 to October 2024?": "It is not possible to construct a no sequel query with the schema provided to determine average sales for 10pm from April 2024 to October 2024.",
    "Please share all under $10 event dates for 2024.": "It is not possible to construct a no sequel query with the schema provided to determine all under $10 event dates for 2024.",
    "Which color of Murano is selling well in 2024?": "It is not possible to construct a no sequel query with the schema provided to determine which color of Murano is selling well in 2024.",
    "Last 7 Friday sales with date.": "It is not possible to construct a no sequel query with the schema provided to determine last 7 Friday sales with date.",
    "Top 10 best selling stones in current year.": "It is not possible to construct a no sequel query with the schema provided to determine the top 10 best selling stones in the current year.",
    "Highest sales month in current year.": "It is not possible to construct a no sequel query with the schema provided to determine the highest sales month in the current year."
}